---
kind: type
id: T:Autodesk.Revit.DB.ColorWithTransparency
source: html/b68f80e1-5ea0-a485-ec3e-7dd077043230.htm
---
# Autodesk.Revit.DB.ColorWithTransparency

Color with transparency

## Syntax (C#)
```csharp
public class ColorWithTransparency : IDisposable
```